Tekla Open API Reference for Tekla Structures 2025
WindowBase.UseDefaultStyle Property
 Use default style in all the window controls or not. If the property is not set in the window constructor the default value (true) is used.
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool UseDefaultStyle { get; set; }
Public Property UseDefaultStyle As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
WindowBase Class
Tekla.Structures.Dialog Namespace